from ._base import BaseSection

class CommonSection(BaseSection):
	"""Общие опции таблицы."""

	#==========================================================================================#
	# >>>>> СВОЙСТВА <<<<< #
	#==========================================================================================#

	@property
	def recycle_id(self) -> bool:
		"""Указывает, необходимо ли занимать освободившиеся ID."""

		return self.__recycle_id

	#==========================================================================================#
	# >>>>> ПЕРЕОПРЕДЕЛЯЕМЫЕ МЕТОДЫ <<<<< #
	#==========================================================================================#

	def _parse(self, data: dict):
		"""
		Парсит данные из переданного словаря.

		:param data: Словарь данных.
		:type data: dict
		"""

		self.__recycle_id = bool(data.get("recycle_id"))

	def _post_init(self):
		"""Метод, выполняющийся после инициализации объекта."""

		self.__recycle_id = True

	def _to_dict(self) -> dict:
		"""
		Возвращает словарное представление объекта.

		:return: Словарное представление объекта.
		:rtype: dict
		"""

		return {
			"recycle_id": self.__recycle_id
		}

	#==========================================================================================#
	# >>>>> ПУБЛИЧНЫЕ МЕТОДЫ <<<<< #
	#==========================================================================================#

	def set_recycle_id(self, status: bool):
		"""
		Задаёт состояние утилизации свободных ID.

		:param status: Состояние утилизации свободных ID.
		:type status: bool
		"""

		self.__recycle_id = status
